{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "CancerDetect", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv4", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv4", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv4", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv4", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv4", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv4", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "avg_pool", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "avg_pool", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["avg_pool", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_4", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_5", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "top_dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "top_dropout", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "pred", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "pred", "inbound_nodes": [[["top_dropout", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["pred", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "batch_normalization_2/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9229625463485718, "scale": 0.0006820468341602998, "original_dtype": "float32"}}, {"name": "batch_normalization_2/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06087781716795528, "scale": 0.0005031224559335147, "original_dtype": "float32"}}, {"name": "batch_normalization_2/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0022064733784645796, "scale": 0.12286171387680167, "original_dtype": "float32"}}, {"name": "batch_normalization_2/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0015800732653588057, "scale": 0.2774584570981781, "original_dtype": "float32"}}, {"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6504510024014641, "scale": 0.004713413060880175, "original_dtype": "float32"}}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.013838226713386236, "scale": 0.006919113356693118, "original_dtype": "float32"}}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21353786885738374, "scale": 0.0017944358727511238, "original_dtype": "float32"}}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9595658239196329, "scale": 0.006805431375316545, "original_dtype": "float32"}}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3364508184732175, "scale": 0.002977440871444403, "original_dtype": "float32"}}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16985343729748445, "scale": 0.002046426955391379, "original_dtype": "float32"}}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18759548786808464, "scale": 0.0016900494402530147, "original_dtype": "float32"}}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5348828196525574, "scale": 0.004494813610525692, "original_dtype": "float32"}}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1714302757207085, "scale": 0.003007548696854535, "original_dtype": "float32"}}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17377639459628685, "scale": 0.0015797854054207896, "original_dtype": "float32"}}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1450568715731303, "scale": 0.0027369221051534018, "original_dtype": "float32"}}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1595982344711528, "scale": 0.0016978535582037532, "original_dtype": "float32"}}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08559678933199714, "scale": 0.0011888442962777381, "original_dtype": "float32"}}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11322855029036016, "scale": 0.001797278576037463, "original_dtype": "float32"}}, {"name": "block3_conv4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0991846270420972, "scale": 0.0013224616938946293, "original_dtype": "float32"}}, {"name": "block3_conv4/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09112793405850728, "scale": 0.0013401166773309894, "original_dtype": "float32"}}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1104835325888559, "scale": 0.0014348510725825442, "original_dtype": "float32"}}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03538777524349736, "scale": 0.0004595814966687969, "original_dtype": "float32"}}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11220526712782243, "scale": 0.0019685134583828498, "original_dtype": "float32"}}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.056611674877942775, "scale": 0.0006582752892784043, "original_dtype": "float32"}}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09138200563542984, "scale": 0.001523033427257164, "original_dtype": "float32"}}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07216294407844544, "scale": 0.0006330082813898722, "original_dtype": "float32"}}, {"name": "block4_conv4/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13608084396988737, "scale": 0.0014028952986586327, "original_dtype": "float32"}}, {"name": "block4_conv4/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11149709335729188, "scale": 0.001173653614287283, "original_dtype": "float32"}}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11863411226693321, "scale": 0.001797486549498988, "original_dtype": "float32"}}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1348205866766911, "scale": 0.0017509167100868974, "original_dtype": "float32"}}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11376928377385233, "scale": 0.0018349884479653602, "original_dtype": "float32"}}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2850242846152362, "scale": 0.0029383946867550122, "original_dtype": "float32"}}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.124724142165745, "scale": 0.0015210261239725, "original_dtype": "float32"}}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4162996549232334, "scale": 0.009505366811565325, "original_dtype": "float32"}}, {"name": "block5_conv4/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11398990750312805, "scale": 0.0011175481127757652, "original_dtype": "float32"}}, {"name": "block5_conv4/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4751522232504452, "scale": 0.03959601860420377, "original_dtype": "float32"}}, {"name": "dense_4/kernel", "shape": [512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16235511513317333, "scale": 0.0013199602856355556, "original_dtype": "float32"}}, {"name": "dense_4/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05744462521637187, "scale": 0.0003419322929545945, "original_dtype": "float32"}}, {"name": "dense_5/kernel", "shape": [512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1695883466916926, "scale": 0.0013787670462739234, "original_dtype": "float32"}}, {"name": "dense_5/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02252076761979683, "scale": 0.00019414454844652438, "original_dtype": "float32"}}, {"name": "pred/kernel", "shape": [256, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18743694751870396, "scale": 0.0014308163932725494, "original_dtype": "float32"}}, {"name": "pred/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.012317344966326275, "scale": 8.494720666431913e-05, "original_dtype": "float32"}}]}]}